{"pages":[],"posts":[{"title":"Skeleton-bridged Point Completion: From Global Inference to Local Adjustment (NeurIPS2020)","text":"Yinyu Nie1,2, Yiqun Lin2, Xiaoguang Han2,*, Shihui Guo3, Jian Chang1 Shuguang Cui2, Jian J Zhang1 1Bournemouth University 2Shenzhen Research Institute of Big Data, The Chinese University of Hong Kong, Shenzhen 3Xiamen University From a partial scan of an object (green points), SK-PCN estimates its meso-skeleton (grey points) to explicitly extract the global structure, and pairs the local-global features for displacement regression to recover the full surface points (blue points) with normals for mesh reconstruction (right). AbstractPoint completion refers to complete the missing geometries of objects from partial point clouds. Existing works usually estimate the missing shape by decoding a latent feature encoded from the input points. However, real-world objects are usually with diverse topologies and surface details, which a latent feature may fail to represent to recover a clean and complete surface. To this end, we propose a skeleton-bridged point completion network (SK-PCN) for shape completion. Given a partial scan, our method first predicts its 3D skeleton to obtain the global structure, and completes the surface by learning displacements from skeletal points. We decouple the shape completion into structure estimation and surface reconstruction, which eases the learning difficulty and benefits our method to obtain on-surface details. Besides, considering the missing features during encoding input points, SK-PCN adopts a local adjustment strategy that merges the input point cloud to our predictions for surface refinement. Comparing with previous methods, our skeleton-bridged manner better supports point normal estimation to obtain the full surface mesh beyond point clouds. The qualitative and quantitative experiments on both point cloud and mesh completion show that our approach outperforms the existing methods on various object categories. Method We illustrate the architecture of SK-PCN above. Given a partial scan, we aim at completing the missing geometries while preserving fidelity on the observable region. To this end, our SK-PCN is designed with a generator for surface completion, and a patch discriminator to distinguish and refine our results with the ground-truth. The generator has two phases: skeleton extraction and skeleton-bridged completion. The skeleton extraction module groups and parallelly aggregates the multi-resolution feature from the input to predict the skeletal points. The completion module shares the similar feature extraction process. It dually obtains multi-resolution features from both the skeleton and the input, and pairs them on each resolution scale. For each pair, a Non-Local Attention module is designed to search the contributive local features from the partial scan to each skeletal point. These local features are then interpolated back to the skeletal points and aggregated to regress their displacements to the shape surface with the corresponding normal vectors on the surface. To preserve the shape information of the observable region, we merge the input to our shape followed with surface adjustment and produce the final mesh with Poisson Surface Reconstruction. See details of each submodule in the paper. CitationIf you are inspired by our work, please consider citing: 123456@article{nie2020skeleton, title={Skeleton-bridged Point Completion: From Global Inference to Local Adjustment}, author={Nie, Yinyu and Lin, Yiqun and Han, Xiaoguang and Guo, Shihui and Chang, Jian and Cui, Shuguang and Zhang, Jian Jun}, journal={arXiv preprint arXiv:2010.07428}, year={2020}} Paper, Code and DataComing soon.","link":"/SKPCN-page/2020/10/12/ProjectPage/"}],"tags":[],"categories":[]}